## Pandas library

In [ ]:
import pandas as pd

#### Dataframe

In [ ]:
datas = [
    ["Mark",55,"Italy",4.5,"Euope"],
    ["john",33,"USA",6.9,"America"],
    ["Tim",41,"USA",3.9,"America"],
]

columns = ["name","age","contry","score","continent"]

df = pd.DataFrame(data=datas,columns= columns)

print(df)

In [ ]:
#Excel
df = pd.read_excel("January.xlsx")
df

In [ ]:
#Excel
df = pd.read_excel("data/sales_data/2021/July.xlsx")
df

In [ ]:
#Excel
df = pd.read_excel("D:\\My Documents\\Desktop\\basic_python\\basic_python_17_nov_2022\\data\\sales_data\\2021\\June.xlsx")
df

In [ ]:
#Excel
df = pd.read_excel("D:/My Documents/Desktop/basic_python/basic_python_17_nov_2022/data/sales_data/2021/June.xlsx")
df

In [ ]:
path = os.getcwd()
path = path + "\\data\\sales_data\\2021"
file_extension = ".xlsx"

xlxs_file_list = []

for root,dirs,files in os.walk(path):
    for name in files: 
        if name.endswith(file_extension):
            file_path = os.path.join(root,name)
            xlxs_file_list.append(file_path)
print(xlxs_file_list)

In [ ]:
dfs = [] 

for f in xlxs_file_list:
    df = pd.read_excel(f)
    dfs.append(df)

In [ ]:
dfs

In [ ]:
len(dfs)

In [ ]:
dfs[2]

In [ ]:
dfs = pd.concat(dfs)
dfs

In [ ]:
#csv
df = pd.read_csv("data/thailand-master-data/th_province.csv")
df

In [ ]:
#API
import requests

url = "https://covid19.ddc.moph.go.th/api/Cases/today-cases-all"
res = requests.get(url, headers={"User-Agent": "Mozilla/5.0"})
data = res.json()
df = pd.DataFrame.from_dict(data)
df

In [ ]:
#API
import requests

url = "https://covid19.ddc.moph.go.th/api/Cases/today-cases-by-provinces"
res = requests.get(url, headers={"User-Agent": "Mozilla/5.0"})
data = res.json()
df = pd.DataFrame.from_dict(data)
df

In [ ]:
#sql server
import pypyodbc

cnxn = pypyodbc.connect("Driver= {SQL Server};"
                         "Server=192.168.1.102\SQLEXPRESS;"
                         "Database=test;"
                         "uid=sa;pwd=sa@admin"
                        )
df = pd.read_sql_query("SELECT * FROM [test].[dbo].[table1]",cnxn)

In [ ]:
df

#### Index

In [ ]:
datas = [
    ["Mark",55,"Italy",4.5,"Euope"],
    ["john",33,"USA",6.9,"America"],
    ["Tim",41,"USA",3.9,"America"],
]

columns = ["name","age","contry","score","continent"]

df = pd.DataFrame(data=datas,columns= columns)

print(df)

In [ ]:
df.sort_index()

In [ ]:
df.sort_index(ascending=False)

In [ ]:
df.sort_values(["continent"])

In [ ]:
df.sort_values(["continent"],ascending=False)

In [ ]:
df.sort_values(["continent","age"])

In [ ]:
df.sort_values(["continent","age"],ascending=False)

#### Columns

In [ ]:
df

In [ ]:
df.columns

In [ ]:
df.columns[0]

In [ ]:
df.rename(columns={"name": "First name","age": "Age"})

In [ ]:
df_rename = df.rename(columns={"name": "First name","age": "Age"})

In [ ]:
df_rename

In [ ]:
df

In [ ]:
df.drop(columns=["name","contry"])

In [ ]:
df.drop(df[df.score < 5].index)

In [ ]:
df.T

## Data Manipulation

#### Selecting Data

In [106]:
df

   name  age contry  score continent
0  Mark   55  Italy    4.5     Euope
1  john   33    USA    6.9   America
2   Tim   41    USA    3.9   America

In [ ]:
df.loc[0,"name"]

In [ ]:
df.loc[1,"score"]

In [105]:
df.loc[[1,2],"score"]

1    6.9
2    3.9
Name: score, dtype: float64

In [108]:
df.loc[:2,["score","continent"]]

   score continent
0    4.5     Euope
1    6.9   America
2    3.9   America

In [109]:
df

   name  age contry  score continent
0  Mark   55  Italy    4.5     Euope
1  john   33    USA    6.9   America
2   Tim   41    USA    3.9   America

In [126]:
df.loc[df["age"] > 40]

   name  age contry  score continent
0  Mark   55  Italy    4.5     Euope
2   Tim   41    USA    3.9   America

In [125]:
df.loc[(df['continent'] == "America") & (df['age'] > 40)]

  name  age contry  score continent
2  Tim   41    USA    3.9   America

In [127]:
df.loc[(df['continent'] == "America") | (df['age'] > 40)]

   name  age contry  score continent
0  Mark   55  Italy    4.5     Euope
1  john   33    USA    6.9   America
2   Tim   41    USA    3.9   America

#### Copy dataframe

In [128]:
df2 = df.copy()
df2

   name  age contry  score continent
0  Mark   55  Italy    4.5     Euope
1  john   33    USA    6.9   America
2   Tim   41    USA    3.9   America

#### Update dataframe

In [129]:
df2

   name  age contry  score continent
0  Mark   55  Italy    4.5     Euope
1  john   33    USA    6.9   America
2   Tim   41    USA    3.9   America

In [132]:
df2.loc[1,"name"] = "JOHN"
df2

   name  age contry  score continent
0  Mark   55  Italy    4.5     Euope
1  JOHN   33    USA    6.9   America
2   Tim   41    USA    3.9   America

In [133]:
df2.loc[df2["age"]> 45,"score"] = 9.9
df2

   name  age contry  score continent
0  Mark   55  Italy    9.9     Euope
1  JOHN   33    USA    6.9   America
2   Tim   41    USA    3.9   America

In [134]:
df2.loc[:,"birth_year"] = 2022-df["age"]
df2

   name  age contry  score continent  birth_year
0  Mark   55  Italy    9.9     Euope        1967
1  JOHN   33    USA    6.9   America        1989
2   Tim   41    USA    3.9   America        1981